src/Documents/АвансовыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АвансовыйОтчет</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыданныеАвансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВхДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВхДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВхДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВхДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПодотчетниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПодотчетниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснования</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АвансовыйОтчет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвансовыйОтчетПотраченно.Ссылка КАК Ссылка,
	|	ЗНАЧЕНИЕ(Документ.СписаниеДенежныхСредств.ПустаяСсылка) КАК ДокументОснования,
	|	АвансовыйОтчетПотраченно.Ссылка.Сотрудник КАК Сотрудник,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	АвансовыйОтчетПотраченно.Ссылка.Дата КАК Период,
	|	АвансовыйОтчетПотраченно.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетПотраченно.Сумма КАК Стоимость
	|ПОМЕСТИТЬ ТаблицаРасчетыСПодотчетниками
	|ИЗ
	|	(ВЫБРАТЬ
	|		АвансовыйОтчетЗапасы.Ссылка КАК Ссылка,
	|		АвансовыйОтчетЗапасы.Сумма КАК Сумма
	|	ИЗ
	|		Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|	ГДЕ
	|		АвансовыйОтчетЗапасы.Ссылка = &Ссылка
	|		И АвансовыйОтчетЗапасы.Сумма > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансовыйОтчетРасходы.Ссылка,
	|		АвансовыйОтчетРасходы.Сумма
	|	ИЗ
	|		Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|	ГДЕ
	|		АвансовыйОтчетРасходы.Ссылка = &Ссылка
	|		И АвансовыйОтчетРасходы.Сумма > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансовыйОтчетОплаты.Ссылка,
	|		АвансовыйОтчетОплаты.Сумма
	|	ИЗ
	|		Документ.АвансовыйОтчет.Оплаты КАК АвансовыйОтчетОплаты
	|	ГДЕ
	|		АвансовыйОтчетОплаты.Ссылка = &Ссылка
	|		И АвансовыйОтчетОплаты.Сумма > 0) КАК АвансовыйОтчетПотраченно
	|ГДЕ
	|	АвансовыйОтчетПотраченно.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвансовыйОтчет.Ссылка КАК Документ,
	|	АвансовыйОтчет.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА АвансовыйОтчет.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ АвансовыйОтчет.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	АвансовыйОтчет.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	АвансовыйОтчет.Ссылка.Дата КАК Период,
	|	АвансовыйОтчет.Сумма КАК Сумма,
	|	АвансовыйОтчет.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыСКонтрагентами
	|ИЗ
	|	Документ.АвансовыйОтчет.Оплаты КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвансовыйОтчетЗапасы.НомерСтроки КАК НомерСтроки,
	|	АвансовыйОтчетЗапасы.Ссылка КАК Документ,
	|	АвансовыйОтчетЗапасы.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	АвансовыйОтчетЗапасы.Ссылка.Дата КАК Период,
	|	АвансовыйОтчетЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	АвансовыйОтчетЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА АвансовыйОтчетЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	АвансовыйОтчетЗапасы.Количество КАК Количество,
	|	АвансовыйОтчетЗапасы.Сумма КАК Сумма,
	|	АвансовыйОтчетЗапасы.Цена КАК Цена,
	|	АвансовыйОтчетЗапасы.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|ГДЕ
	|	АвансовыйОтчетЗапасы.Ссылка = &Ссылка
	|	И НЕ АвансовыйОтчетЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(АвансовыйОтчетЗапасы.НомерСтроки) КАК НомерСтроки,
	|	АвансовыйОтчетЗапасы.Ссылка.Дата КАК Период,
	|	АвансовыйОтчетЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет) КАК СчетКт,
	|	АвансовыйОтчетЗапасы.Номенклатура КАК СубконтоДт1,
	|	АвансовыйОтчетЗапасы.Склад КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК СубконтоДт4,
	|	АвансовыйОтчетЗапасы.Ссылка.Сотрудник КАК СубконтоКт1,
	|	СУММА(АвансовыйОтчетЗапасы.Сумма) КАК Сумма,
	|	АвансовыйОтчетЗапасы.Количество КАК Количество,
	|	""Авансовый отчет"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.АвансовыйОтчет.Запасы КАК АвансовыйОтчетЗапасы
	|ГДЕ
	|	АвансовыйОтчетЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетЗапасы.Ссылка.Дата,
	|	АвансовыйОтчетЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	АвансовыйОтчетЗапасы.Номенклатура,
	|	АвансовыйОтчетЗапасы.Ссылка.Сотрудник,
	|	АвансовыйОтчетЗапасы.Склад,
	|	АвансовыйОтчетЗапасы.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(АвансовыйОтчетРасходы.НомерСтроки),
	|	АвансовыйОтчетРасходы.Ссылка.Дата,
	|	АвансовыйОтчетРасходы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет),
	|	АвансовыйОтчетРасходы.СтатьяЗатрат,
	|	АвансовыйОтчетРасходы.Специализация,
	|	NULL,
	|	NULL,
	|	АвансовыйОтчетРасходы.Ссылка.Сотрудник,
	|	СУММА(АвансовыйОтчетРасходы.Сумма),
	|	NULL,
	|	""Авансовый отчет""
	|ИЗ
	|	Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|ГДЕ
	|	АвансовыйОтчетРасходы.Ссылка = &Ссылка
	|	И АвансовыйОтчетРасходы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетРасходы.Ссылка.Дата,
	|	АвансовыйОтчетРасходы.Ссылка.СтруктурнаяЕдиница,
	|	АвансовыйОтчетРасходы.Ссылка.Сотрудник,
	|	АвансовыйОтчетРасходы.Специализация,
	|	АвансовыйОтчетРасходы.СтатьяЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(АвансовыйОтчетРасходы.НомерСтроки),
	|	АвансовыйОтчетРасходы.Ссылка.Дата,
	|	АвансовыйОтчетРасходы.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет),
	|	АвансовыйОтчетРасходы.Специализация,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	АвансовыйОтчетРасходы.Ссылка.Сотрудник,
	|	АвансовыйОтчетРасходы.СтатьяЗатрат,
	|	АвансовыйОтчетРасходы.Сотрудник,
	|	СУММА(АвансовыйОтчетРасходы.Сумма),
	|	NULL,
	|	""Авансовый отчет""
	|ИЗ
	|	Документ.АвансовыйОтчет.Расходы КАК АвансовыйОтчетРасходы
	|ГДЕ
	|	АвансовыйОтчетРасходы.Ссылка = &Ссылка
	|	И АвансовыйОтчетРасходы.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетРасходы.Ссылка.Дата,
	|	АвансовыйОтчетРасходы.Ссылка.СтруктурнаяЕдиница,
	|	АвансовыйОтчетРасходы.Ссылка.Сотрудник,
	|	АвансовыйОтчетРасходы.Специализация,
	|	АвансовыйОтчетРасходы.СтатьяЗатрат,
	|	АвансовыйОтчетРасходы.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(АвансовыйОтчетОплаты.НомерСтроки),
	|	АвансовыйОтчетОплаты.Ссылка.Дата,
	|	АвансовыйОтчетОплаты.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Подотчет),
	|	АвансовыйОтчетОплаты.Контрагент,
	|	NULL,
	|	NULL,
	|	NULL,
	|	АвансовыйОтчетОплаты.Ссылка.Сотрудник,
	|	СУММА(АвансовыйОтчетОплаты.Сумма),
	|	NULL,
	|	""Авансовый отчет""
	|ИЗ
	|	Документ.АвансовыйОтчет.Оплаты КАК АвансовыйОтчетОплаты
	|ГДЕ
	|	АвансовыйОтчетОплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АвансовыйОтчетОплаты.Ссылка.Дата,
	|	АвансовыйОтчетОплаты.Ссылка.СтруктурнаяЕдиница,
	|	АвансовыйОтчетОплаты.Контрагент,
	|	АвансовыйОтчетОплаты.Ссылка.Сотрудник";
		
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаОприходованиеЗапасов);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПартииТоваров(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);
	СформироватьТаблицаУстановкаЦен(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПодотчетниками(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСПодотчетниками.Ссылка,	
	|	РасчетыСПодотчетниками.ДокументОснования,
	|	РасчетыСПодотчетниками.Период,
	|	РасчетыСПодотчетниками.СтруктурнаяЕдиница,
	|	РасчетыСПодотчетниками.Сотрудник,
	|	РасчетыСПодотчетниками.ВидДвижения,
	|	СУММА(РасчетыСПодотчетниками.Стоимость) КАК Сумма
	|ИЗ
	|	ТаблицаРасчетыСПодотчетниками КАК РасчетыСПодотчетниками
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПодотчетниками.Ссылка,	
	|	РасчетыСПодотчетниками.ДокументОснования,	
	|	РасчетыСПодотчетниками.Период,
	|	РасчетыСПодотчетниками.СтруктурнаяЕдиница,
	|	РасчетыСПодотчетниками.Сотрудник,
	|	РасчетыСПодотчетниками.ВидДвижения";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда		
		Авансы = ВернутьВыданныеАвансыПоДокументу(РезультатЗапроса[0].Ссылка);
		Если Авансы.Количество() > 0 Тогда 
			Если Авансы.Количество() = 1 Тогда 
				РезультатЗапроса[0].ДокументОснования = Авансы[0].Документ;
			Иначе
				// подготовим таблицу
				ТаблицаДляДвижений = РезультатЗапроса.Скопировать();
				ТаблицаДляДвижений.Очистить();
				ПотраченнаяСумма = РезультатЗапроса[0].Сумма;
				Для Каждого СтрокаАвансы Из Авансы Цикл
					Если ПотраченнаяСумма > 0 Тогда 
						Если СтрокаАвансы.Сумма < ПотраченнаяСумма ИЛИ СтрокаАвансы.Сумма = ПотраченнаяСумма Тогда 
							НоваяСтрока = ТаблицаДляДвижений.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса[0]);
							НоваяСтрока.Сумма 				= СтрокаАвансы.Сумма;
							НоваяСтрока.ДокументОснования 	= СтрокаАвансы.Документ;
							ПотраченнаяСумма = ПотраченнаяСумма - СтрокаАвансы.Сумма;
						Иначе 
							НоваяСтрока = ТаблицаДляДвижений.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, РезультатЗапроса[0]);
							НоваяСтрока.Сумма 				= ПотраченнаяСумма;
							НоваяСтрока.ДокументОснования 	= СтрокаАвансы.Документ;
							ПотраченнаяСумма = ПотраченнаяСумма - НоваяСтрока.Сумма;							
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				РезультатЗапроса = ТаблицаДляДвижений;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗапроса.Колонки.Удалить("Ссылка");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПодотчетниками", РезультатЗапроса);	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

 // Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартииТоваров(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаПартииТоваров.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаПартииТоваров.Период КАК Период,
	|	ТаблицаПартииТоваров.Документ КАК ДокументПоступления,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаПартииТоваров.Склад КАК Склад,
	|	СУММА(ТаблицаПартииТоваров.Количество) КАК Количество,
	|	СУММА(ТаблицаПартииТоваров.Сумма) КАК Стоимость,
	|	ТаблицаПартииТоваров.Партия
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПартииТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПартииТоваров.Период,
	|	ТаблицаПартииТоваров.Документ,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура,
	|	ТаблицаПартииТоваров.Склад,
	|	ТаблицаПартииТоваров.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаПоступлениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыСКонтрагентами КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	СУММА(ВременнаяТаблицаУправленческий.Сумма) КАК Сумма,
	|	СУММА(ВременнаяТаблицаУправленческий.Количество) КАК Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаУправленческий.НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Содержание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяТаблицаУправленческий.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУстановкаЦен(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаЗапасы.Период,
	|	ВременнаяТаблицаЗапасы.Номенклатура,
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.Документ.ВидЦен КАК ВидЦен,
	|	ВременнаяТаблицаЗапасы.Упаковка,
	|	ВременнаяТаблицаЗапасы.Цена КАК Цена,
	|	ВременнаяТаблицаЗапасы.Документ.АвторДокумента КАК Автор,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ВременнаяТаблицаЗапасы
	|ГДЕ
	|	ВременнаяТаблицаЗапасы.Цена <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаЗапасы.Период,
	|	ВременнаяТаблицаЗапасы.Номенклатура,
	|	ВременнаяТаблицаЗапасы.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаЗапасы.Документ.ВидЦен,
	|	ВременнаяТаблицаЗапасы.Упаковка,
	|	ВременнаяТаблицаЗапасы.Документ.АвторДокумента,
	|	ВременнаяТаблицаЗапасы.Цена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановкаЦен", РезультатЗапроса.Выгрузить());		
	
КонецПроцедуры

// Вернуть документы основания выданных авансов
Функция ВернутьВыданныеАвансыПоДокументу(Ссылка)
	
	ЗапросПоАвансам = Новый Запрос;
	ЗапросПоАвансам.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АвансовыйОтчетВыданныеАвансы.НомерСтроки,
	|	АвансовыйОтчетВыданныеАвансы.Документ,
	|	АвансовыйОтчетВыданныеАвансы.Сумма
	|ИЗ
	|	Документ.АвансовыйОтчет.ВыданныеАвансы КАК АвансовыйОтчетВыданныеАвансы
	|ГДЕ
	|	АвансовыйОтчетВыданныеАвансы.Ссылка = &Ссылка
	|	И АвансовыйОтчетВыданныеАвансы.Сумма > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	АвансовыйОтчетВыданныеАвансы.Документ.Дата";
				   
	ЗапросПоАвансам.УстановитьПараметр("Ссылка", Ссылка);
	Возврат ЗапросПоАвансам.Выполнить().Выгрузить();
	
КонецФункции

  #Область ПроцедурыПечатиДокумента

// Процедура печати документа.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АО1") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АО1",
			"Авансовый отчет",
			СформироватьПечатнуюФормуАО1(МассивОбъектов, ОбъектыПечати)
		);
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция СформироватьПечатнуюФормуАО1(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АвансовыйОтчет";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		
		Запрос.Текст =
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	АвансовыйОтчет.Номер,
		|	АвансовыйОтчет.Дата КАК ДатаДокумента,
		|	АвансовыйОтчет.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	АвансовыйОтчет.Сотрудник КАК Сотрудник,
		|	АвансовыйОтчет.СуммаДокумента,
		|	АвансовыйОтчет.ВыданныеАвансы КАК ВыданныеАвансы,
		|	АвансовыйОтчет.Запасы КАК Запасы,
		|	АвансовыйОтчет.Расходы КАК Расходы,
		|	АвансовыйОтчет.Оплаты КАК Оплаты
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АвансовыйОтчет_АвансовыйОтчет";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АвансовыйОтчет.ПФ_MXL_АО1");
		
		// ТИТУЛЬНЫЙ ЛИСТ
		МассивАвансовыхДокументов = Шапка.ВыданныеАвансы.Выгрузить().ВыгрузитьКолонку("Документ");
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Сотрудник",  Шапка.Сотрудник);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Шапка.СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ДатаИтогов", Шапка.ДатаДокумента);
		Запрос.УстановитьПараметр("МассивАвансовыхДокументов", МассивАвансовыхДокументов);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВложенныйЗапрос.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСПодотчетникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|	ИЗ
		|		РегистрНакопления.РасчетыСПодотчетниками.Остатки(
		|				&ДатаИтогов,
		|				СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|					И Сотрудник = &Сотрудник) КАК РасчетыСПодотчетникамиОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА РасчетыСПодотчетниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЕСТЬNULL(РасчетыСПодотчетниками.Сумма, 0)
		|			ИНАЧЕ -ЕСТЬNULL(РасчетыСПодотчетниками.Сумма, 0)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.РасчетыСПодотчетниками КАК РасчетыСПодотчетниками
		|	ГДЕ
		|		РасчетыСПодотчетниками.Регистратор В(&МассивАвансовыхДокументов)
		|		И РасчетыСПодотчетниками.Период <= &ДатаИтогов) КАК ВложенныйЗапрос";
		ПредыдущийАванс = Запрос.Выполнить().Выгрузить();
		СуммаДоДокумента = Число(ПредыдущийАванс.Итог("СуммаОстаток"));
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("МассивАвансовыхДокументов", МассивАвансовыхДокументов);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(СписаниеДенежныхСредств.СуммаДокумента) КАК СуммаДокумента
		|ИЗ
		|	Документ.СписаниеДенежныхСредств КАК СписаниеДенежныхСредств
		|ГДЕ
		|	СписаниеДенежныхСредств.Ссылка В(&МассивАвансовыхДокументов)
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеДенежныхСредств.Ссылка";
		Таб = Запрос.Выполнить().Выгрузить();
		ПолученоИзКассы = Число(Таб.Итог("СуммаДокумента"));
		
		ОбластьМакета = Макет.ПолучитьОбласть("Титул");
		
		// Выводим титульный лист авансового отчета
		ОбластьМакета.Параметры.суммарубкоп1= "Сумма" +ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти()+","+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
		ОбластьМакета.Параметры.суммарубкоп2=ОбластьМакета.Параметры.суммарубкоп1;
		ОбластьМакета.Параметры.суммарубкоп3=ОбластьМакета.Параметры.суммарубкоп1;
        ОбластьМакета.Параметры.ТекРуб1= ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		ОбластьМакета.Параметры.ТекРуб2= ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		  ОбластьМакета.Параметры.дробчасть1 = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
		  ОбластьМакета.Параметры.дробчасть2 = ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыДробнойЧасти();
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПодотчетноеЛицо           = Шапка.Сотрудник;
		ОбластьМакета.Параметры.ДолжностьПодотчетногоЛица = Шапка.Сотрудник.Должность;
		ОбластьМакета.Параметры.НомерДокумента            = Шапка.Номер;
		ОбластьМакета.Параметры.ПолученоИзКассы           = ПолученоИзКассы;
		
		Если СуммаДоДокумента >= 0 тогда
			ОбластьМакета.Параметры.НачальныйОстаток    =   СуммаДоДокумента;
		Иначе
			ОбластьМакета.Параметры.НачальныйПерерасход = - СуммаДоДокумента;
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИтогоПолучено = ПолученоИзКассы;
		ОбластьМакета.Параметры.Израсходовано = Шапка.СуммаДокумента;
		
		ОстатокНаКонец = СуммаДоДокумента + ПолученоИзКассы - Шапка.СуммаДокумента;
		Если ОстатокНаКонец >= 0  Тогда
			ОбластьМакета.Параметры.КонечныйОстаток    = ОстатокНаКонец;
		Иначе
			ОбластьМакета.Параметры.КонечныйПерерасход = - ОстатокНаКонец;
		КонецЕсли;
		
		Руководитель        = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Руководитель);
		ГлавныйБухгалтер	= ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер);
		Кассир              = ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(Шапка.СтруктурнаяЕдиница.Организация, Перечисления.ТипыОтветственныхЛиц.Кассир);
		
		ИспСумма     = Окр(Шапка.СуммаДокумента, 2, 1);
		ЦелСумма     = Цел(Шапка.СуммаДокумента);
		КопСумма     = 100 * (Окр(ИспСумма - ЦелСумма, 2, 1));
		Если КопСумма = 0 Тогда
			КопСумма= "00";
		КонецЕсли;
		
		ОбластьМакета.Параметры.ИзрасходованоРуб    = ЦелСумма;
		ОбластьМакета.Параметры.ИзрасходованоКоп    = КопСумма;
		
		ОбластьМакета.Параметры.ДатаДокумента       = Шапка.ДатаДокумента;
		
		ОбластьМакета.Параметры.СуммаОтчетаПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(Шапка.СуммаДокумента);
			
		ОбластьМакета.Параметры.Организация         	= Шапка.СтруктурнаяЕдиница.Организация;
		ОбластьМакета.Параметры.Руководитель        	= ?(Руководитель.Количество() > 0, Руководитель[0].Сотрудник, "");
		ОбластьМакета.Параметры.ДолжностьРуководителя	= ?(Руководитель.Количество() > 0, Руководитель[0].Должность, "");
		ОбластьМакета.Параметры.ГлавныйБухгалтер		= ?(ГлавныйБухгалтер.Количество() > 0, ГлавныйБухгалтер[0].Сотрудник, "");
		ОбластьМакета.Параметры.Кассир              	= ?(Кассир.Количество() > 0, Кассир[0].Сотрудник, "");
			
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// ОБОРОТНАЯ СТОРОНА
		
		Запасы = Шапка.Запасы.Выбрать();
		Расходы = Шапка.Расходы.Выбрать();
		Оплаты = Шапка.Оплаты.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.суммарубкоп4= "В"+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		ОбластьМакета.Параметры.суммарубкоп5= "В"+ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
		

		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		// Выводим табличные части
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		НомерСтроки   = 0;
		
		ИтогоПоОтчету        = 0;
		
		
		
		

		
		
		
		Пока Запасы.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(Запасы);
			НомерСтроки = НомерСтроки + 1;
			ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
			ОбластьМакета.Параметры.НаименованиеРасхода = Запасы.Номенклатура;
			
			ОбластьМакета.Параметры.ПоОтчету = Запасы.Сумма;
			ОбластьМакета.Параметры.ПоУчету  = Запасы.Сумма;
			
			ИтогоПоОтчету = ИтогоПоОтчету + Запасы.Сумма;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
				НомерСтроки = ?(ЗначениеЗаполнено(Запасы.НомерСтроки), Запасы.НомерСтроки, 0);
		
		Пока Расходы.Следующий() Цикл
		
			ОбластьМакета.Параметры.Заполнить(Расходы);
			НомерСтроки = НомерСтроки + 1;
			ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
			ОбластьМакета.Параметры.НаименованиеРасхода = Расходы.Номенклатура;
				
			ОбластьМакета.Параметры.ПоОтчету = Расходы.Сумма;
			ОбластьМакета.Параметры.ПоУчету  = Расходы.Сумма;
			
			ИтогоПоОтчету = ИтогоПоОтчету + Расходы.Сумма;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		Пока Оплаты.Следующий() Цикл
		
			ОбластьМакета.Параметры.Заполнить(Оплаты);
			НомерСтроки = НомерСтроки + 1;
			ОбластьМакета.Параметры.НомерСтроки         = НомерСтроки;
			ОбластьМакета.Параметры.НаименованиеРасхода = НСтр("ru = 'Оплата контрагенту '") + Оплаты.Контрагент;
			
			ОбластьМакета.Параметры.ПоОтчету = Оплаты.Сумма;
			ОбластьМакета.Параметры.ПоУчету  = Оплаты.Сумма;
			
			ИтогоПоОтчету = ИтогоПоОтчету + Оплаты.Сумма;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		// Выводим подвал авансовго отчета
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПодотчетноеЛицо 	 = Шапка.Сотрудник;
		ОбластьМакета.Параметры.ИтогоПоОтчету        = ИтогоПоОтчету;
		ОбластьМакета.Параметры.ИтогоПоУчету         = ИтогоПоОтчету;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("АО1", "Авансовый отчет", , БиблиотекаКартинок.Документ);
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
